public_html/ci4/app/Models/NewsModel.php

    public function getNews($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
---
SELECT *
FROM `news`