public_html/ci4/app/Controllers/News.php

    public function create()
    {
        helper('form');

        $data = $this->request->getPost(['title', 'body', 'author']);

        // Checks whether the submitted data passed the validation rules.
        if (! $this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
            'author' => 'required|max_length[50]|min_length[3]',
        ])) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        $model->save([
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
            'author'  => $post['author']
        ]);
---
INSERT INTO `news` (`title`, `slug`, `body`, `author`) VALUES ('Activity', 'activity', 'This is a test run', 'Jessa')